backend/app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("uin", "name", "major", "tshirt_size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["uin", 132000494], ["name", "Charles Morris"], ["major", nil], ["tshirt_size", nil], ["created_at", "2024-09-18 18:38:13.581129"], ["updated_at", "2024-09-18 18:38:13.581129"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "major" = $1, "tshirt_size" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["major", "Agricultural Systems Management"], ["tshirt_size", "XL"], ["updated_at", "2024-09-18 19:12:49.369027"], ["id", 6]]